Revit 2027 API
ClosestPointsPairBetweenTwoCurves.ParameterOnSecondCurve Property
 1d raw (not normalized) parameter of the point on the second curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ParameterOnSecondCurve { get; set; }
Public Property ParameterOnSecondCurve As Double
	Get
	Set
public:
property double ParameterOnSecondCurve {
	double get ();
	void set (double value);
}
member ParameterOnSecondCurve : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  The property has not been set by the method providing the result.
See Also
Reference
ClosestPointsPairBetweenTwoCurves Class
Autodesk.Revit.DB Namespace